In [13]:
import pandas as pd

ratings1_dat = pd.read_csv('data/ratings1.csv', sep=',')
ratings2_dat = pd.read_csv('data/ratings2.csv', sep=',')
date_dat = pd.read_csv('data/dates.csv', sep=',')
print(ratings1_dat.shape)
display(ratings1_dat.head(5))
print(ratings2_dat.shape)
display(ratings2_dat.head(5))
print(date_dat.shape)
display(date_dat.head(5))

(40001, 3)

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

(60836, 3)

   userId  movieId  rating
0     274     5621     2.0
1     274     5630     3.0
2     274     5667     3.5
3     274     5679     3.5
4     274     5690     3.0

(100836, 1)

                  date
0  2000-07-30 18:45:03
1  2000-07-30 18:20:47
2  2000-07-30 18:37:04
3  2000-07-30 19:03:35
4  2000-07-30 18:48:51

userId — уникальный идентификатор пользователя, который выставил оценку;
movieId — уникальный идентификатор фильма;
rating — рейтинг фильма

In [8]:
move_dat = pd.read_csv('data/movies.csv', sep=',')#, index_col='movieId')

print(move_dat.shape)
move_dat.head(5)
# move_dat.tail()

# # выделили категориальные признаки и преобразовали их в тип данных
# cols_to_exclude = ['Date', 'Rooms', 'Bedroom', 'Bathroom', 'Car'] # список столбцов, которые мы не берём во внимание
# max_unique_count = 150 # задаём максимальное число уникальных категорий
# for col in melb_df.columns: # цикл по именам столбцов
#     if melb_df[col].nunique() < max_unique_count and col not in cols_to_exclude: # проверяем условие
#         melb_df[col] = melb_df[col].astype('category') # преобразуем тип столбца

(9742, 3)
9742
9737

movieId — уникальный идентификатор фильма;
title — название фильма и год его выхода;
genres — жанры фильма.

5.2

In [9]:
print(move_dat['movieId'].nunique())
print(move_dat['title'].nunique())

9742
9737

5.3

In [10]:
print(ratings1_dat['userId'].nunique())

274

5.4

In [12]:
date_ye = pd.to_datetime(date_dat['date'],yearfirst=True).dt.year
print(date_ye.value_counts())

date
2000    10061
2017     8198
2007     7114
2016     6703
2015     6616
2018     6418
1996     6040
2005     5813
2012     4656
2008     4351
2009     4158
2006     4059
2003     4014
2001     3922
2002     3478
2004     3279
1999     2439
2010     2301
1997     1916
2011     1690
2013     1664
2014     1439
1998      507
Name: count, dtype: int64

In [4]:
# def date_to(x):
#     c=x[::-1]
#     a=c.find(')')
#     b=c.find('(')
#     if  (b-a)>4:
#         c=c[a+1:b]
#         return c[::-1]
#     return pd.NaT

# move_dat['Date']=move_dat['title'].apply(date_to)

# move_dat.tail()
# move_dat['Date'].value_counts()

-6.0